import random
from pyrogram import Client, filters, enums
from info import COMMAND_HAND_LER
from plugins.helper_functions.cust_p_filters import f_onw_fliter


RUN_STRINGS = (
    "اوہ.. گستاخی... پہلے جیسی.... کوئی تبدیلی نہیں..... یہ وہ تھوک نہیں ہے جو کورس میں نہیں آتا...!!!"
     "اللہ... ہر بچے کا... جذبہ..."
     "مجھے نہیں آتا لکھنا جناب... مجھے پڑھنا نہیں آتا..."
     "آج خاموش نہ رہو آج کے قلعے کے بعد..."
     "یہ سوچ کر کہ یہ راکھ ہے، اگر تم نے اسے نہیں بنایا تو یہ جل جائے گی۔"
     "سمجھیں کہ صرف ایک ہی زندگی ہے، نہ کوئی جنت ہے اور نہ کوئی جہنم، 'ایک زندگی'، وہ کہاں اور کیسے چاہتا ہے"۔"
     "کیسا دھماکا خیز دھماکہ! ایسا خوفناک انکشاف!!"
     "چلے جاؤ بیوقوف میری بیوی اور بیٹی کے گھر میں تم آج کا میرا منٹ نہیں دیکھو گے... نیچے مت جاؤ..."
     "میں یہ کر سکتا ہوں کیا میں وہ کر سکتا ہوں"
     "صرف اس لیے کہ کریم بسکٹ میں کریم ہوتی ہے، شیر کے بسکٹ میں شیر نہیں ہوتا۔ پانی دودھ، یار..."
     "یہ ایسا ہی ہے جب پاٹا ڈر گیا اور پنتھلم میں گیا، یہ ایسا ہی ہے جیسے پنٹوم نے کہا کہ پنتھلم میں جاؤ۔"
     "میرے رب.... آپ مجھے اچھا نہیں ہونے دیں گے۔"
     "کار کا انجن مکمل طور پر ختم..."
     "ابھی ختم نہیں ہوا!"
     "کیا تمہارے باپ نے آدھی رات کے لیے پورٹا اور چکن بنایا ہے..."
     "اوہ، جب تم پیار کرتے ہو، یہ محبت ہے، جب ہم محبت میں پڑتے ہیں، یہ تار ہے ...."
     "خدا مجھے اکیلے بچا لے..."
     "اس کی خاطر نشے میں ٹڈی اور گیلی بارش برباد کر دو..."
     "کہاں رہی ہو اتنی دیر...!"
     "آپ کو انگریزی زیادہ نہیں آتی، کیا آپ؟"
     "تمام خواب چمکتے ستاروں کی طرح..."
     "میرا پرانتھن تھاپا اسے راستہ بنا دو"
     "کیا تم مجھے جہیز کی رقم دو گے علی؟"
     "تم بہت تھک گئے ہو"
     "میں آنکھوں میں آنسو لیے انتظار کر رہا تھا۔"
     "چلو جا کر کہتے ہیں، لکڑی۔
     خونی گرامواسی منہ بند کرو۔"
     "چلو۔
     پٹو تمھارے ساتھ مروں گا"،
     "آپ کی وجہ سے، مقامی لوگوں اور وہ لوگ جنہوں نے گنولیا کو چھوڑ دیا، گنولیا کیوں شرمندہ ہیں اور اس طرح جی رہے ہیں، لارڈ چینگتالی وازہ۔"
)


@Client.on_message(
    filters.command("runs", COMMAND_HAND_LER) &
    f_onw_fliter
)
async def runs(_, message):
    """ /runs strings """
    effective_string = random.choice(RUN_STRINGS)
    if message.reply_to_message:
        await message.reply_to_message.reply_text(effective_string)
    else:
        await message.reply_text(effective_string)
